Revit 2027 API
CableType.ConductorMaterial Property
 The Conductor Material of this Cable Type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ConductorMaterial { get; set; }
Public Property ConductorMaterial As ElementId
	Get
	Set
public:
property ElementId^ ConductorMaterial {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ConductorMaterial : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a Conductor Material id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace